Repository: nextdaysoft/kschool_New_IOS
Catalog: Kids/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Healthy Food Habits Level
zh_hans: 健康饮食习惯等级

source: Healthy Habits Level
zh_hans: 健康习惯等级

source: Healthy vs Unhealthy Level
zh_hans: 健康与不健康食物等级

source: Hear and Find
zh_hans: 听一听并找出来

source: Hear and Find Level
zh_hans: 听一听并找出来等级

source: Hear it, see it, say it!
zh_hans: 听一听，看一看，说一说！

source: Hear the planet sound... now choose the correct planet!
zh_hans: 听行星的声音……现在选择正确的行星！

source: Hear the sound... now choose the correct picture!
zh_hans: 听声音……现在选择正确的图片！

source: Hear the sound... now choose the correct planet!
zh_hans: 听声音……现在选择正确的行星！

source: Heavier
zh_hans: 较重

source: HELICOPTER
zh_hans: 直升机

source: hello
zh_hans: 你好

source: Help
zh_hans: 帮助

source: Help the %@ reach the %@! %@ %@ The %@ can only step on vowels: A, E, I, O, U.
zh_hans: %@ %@ 帮助%@到达%@！%@只能踩在元音字母 A、E、I、O、U 上。

source: Help the monkey to get the bananas.
zh_hans: 帮助猴子拿到香蕉。

source: hen
zh_hans: 母鸡

source: Hen
zh_hans: 母鸡

source: Herbivores Animals
zh_hans: 食草动物

source: Heron
zh_hans: 苍鹭

source: Hide
zh_hans: 隐藏

source: Hide it
zh_hans: 藏起来

source: high
zh_hans: 高高地

source: hill, fill, _ _ _
zh_hans: 小山，装满，_ _ _

source: Hint
zh_hans: 提示

source: Hockey Stick
zh_hans: 曲棍球杆

source: Hold
zh_hans: 拿着

source: Hornbill
zh_hans: 犀鸟

source: Horse
zh_hans: 马

source: hose
zh_hans: 软管

source: hot
zh_hans: 炎热

source: Hot
zh_hans: 热

source: House
zh_hans: 房子

source: Household items
zh_hans: 家居用品

source: How are Mercury’s temperatures?
zh_hans: 水星的温度如何？

source: How does the apple taste?
zh_hans: 苹果尝起来怎么样？

source: How does Venus spin?
zh_hans: 金星如何自转？

source: How far is Jupiter from the Sun?
zh_hans: 木星距离太阳有多远？

source: How far is Mars from the Sun?
zh_hans: 火星距离太阳有多远？

source: How far is Saturn from the Sun?
zh_hans: 土星距离太阳有多远？

source: How hot is the Sun?
zh_hans: 太阳有多热？

source: How is Saturn by weight?
zh_hans: 土星的重量特征是什么？

source: How is the banana?
zh_hans: 香蕉怎么样？

source: How is the bird’s song?
zh_hans: 鸟的歌声怎么样？

source: How is the sun?
zh_hans: 太阳怎么样？

source: How is the tree?
zh_hans: 这棵树怎么样？

source: How long does sunlight take to reach Earth?
zh_hans: 阳光到达地球需要多长时间？

source: How long does the Moon take to orbit Earth?
zh_hans: 月球绕地球一周需要多长时间？

source: How many days does Earth take to orbit the Sun?
zh_hans: 地球绕太阳一周需要多少天？

source: How many moons does Earth have?
zh_hans: 地球有多少颗卫星？

source: How many moons does Mars have?
zh_hans: 火星有多少颗卫星？

source: How often does Earth spin?
zh_hans: 地球多久自转一次？

source: Hyena
zh_hans: 鬣狗

source: Hyphen
zh_hans: 连字符

source: I _ _ _ a student.
zh_hans: 我___是一名学生。

source: I _ _ _ at the park
zh_hans: 我___在公园里。

source: I _ _ _ hungry
zh_hans: 我___饿了。

source: I _ _ _ hungry.
zh_hans: 我___饿了。

source: I am hungry
zh_hans: 我饿了

source: I catch the ball.
zh_hans: 我接住球。

source: I eat ___ ice cream
zh_hans: 我吃___冰淇淋

source: I eat the apple.
zh_hans: 我吃苹果。

source: I eat the banana.
zh_hans: 我吃香蕉。

source: I go _ _ _ school.
zh_hans: 我去 _ _ _ 学校。

source: I have _ _ _ books.
zh_hans: 我有四本书。

source: I have _ _ _ toys.
zh_hans: 我有 _ _ _ 个玩具。

source: I have two _ _ _.
zh_hans: 我有两个 _ _ _。

source: I like apples
zh_hans: 我喜欢苹果

source: I like apples _ _ _.
zh_hans: 我也喜欢苹果 _ _ _。

source: I like ice cream _ _ _.
zh_hans: 我也喜欢冰淇淋 _ _ _。

source: I made a card _ _ _ you.
zh_hans: 我为你做了一张卡片。

source: I play with my dog.
zh_hans: 我和我的狗一起玩。

source: I see ___ banana
zh_hans: 我看见___香蕉

source: I see ___ cat
zh_hans: 我看见___猫

source: I throw the ball.
zh_hans: 我扔球。

source: I want ___ apple
zh_hans: 我想要___苹果

source: Ibis
zh_hans: 鹮

source: Ice
zh_hans: 冰

source: Ice rings
zh_hans: 冰环

source: Identify action verb
zh_hans: 识别动作动词

source: Identify Letter
zh_hans: 识别字母

source: Identify Number
zh_hans: 识别数字

source: Identify the Number Level
zh_hans: 数字识别级别

source: Idioms
zh_hans: 成语

source: Important to remember:
zh_hans: 重要提示：

source: in
zh_hans: 在

source: In
zh_hans: 在……里面

source: In nest
zh_hans: 在巢里

source: In the house
zh_hans: 在房子里

source: In the sky
zh_hans: 在天空中

source: In the tree
zh_hans: 在树上

source: in the yard
zh_hans: 在院子里

source: In tree
zh_hans: 在树上

source: In water
zh_hans: 在水里

source: India
zh_hans: 印度

source: Indigo
zh_hans: 靛蓝色

source: Indonesia
zh_hans: 印度尼西亚

source: Inside
zh_hans: 里面

source: Internal Body Parts
zh_hans: 内部身体器官

source: Into
zh_hans: 进入

source: Inverter
zh_hans: 逆变器

source: Iran
zh_hans: 伊朗

source: Iraq
zh_hans: 伊拉克

source: Iron
zh_hans: 熨斗

source: is
zh_hans: 是

source: is / am / are
zh_hans: 系动词

source: is / am/ are
zh_hans: 是

source: Is it raining?
zh_hans: 正在下雨吗？

source: Is she reading a book?
zh_hans: 她在读书吗？

source: Is the apple red or yellow?
zh_hans: 苹果是红色还是黄色？

source: Is the ball round or flat?
zh_hans: 球是圆的还是平的？

source: Is the banana yellow or red?
zh_hans: 香蕉是黄色还是红色？

source: Is the car blue or red?
zh_hans: 汽车是蓝色还是红色？

source: Is the cat yellow or black?
zh_hans: 这只猫是黄色还是黑色？

source: Is the dog big or small?
zh_hans: 这只狗是大还是小？

source: Is the fish slow or fast?
zh_hans: 鱼是慢还是快？

source: Is the sky blue?
zh_hans: 天空是蓝色的吗？

source: Is the tree green or brown?
zh_hans: 树是绿色还是棕色？

source: It _ _ _ a sunny day
zh_hans: 那天___是个晴天。

source: It _ _ _ cold.
zh_hans: 天气___很冷。

source: It can swim fast.
zh_hans: 它能快速游泳。

source: It gives us light.
zh_hans: 它给我们光。

source: It gives us shade.
zh_hans: 它给我们树荫。

source: It has a small tail.
zh_hans: 它有一条小尾巴。

source: It is raining
zh_hans: 正在下雨

source: It likes to drink milk.
zh_hans: 它喜欢喝牛奶。

source: It sings a sweet song.
zh_hans: 它唱着甜美的歌。

source: It's game time! Put the names on the right parts of the plant!
zh_hans: 游戏时间！将名称放到植物的正确部位！

source: It's play time! Drag the names to the right computer parts!
zh_hans: 游戏时间到了！将名称拖到正确的电脑部件上！

source: It's play time! Put the foods in the right box - Healthy or Unhealthy!
zh_hans: 游戏时间！把食物放入正确的框中——健康或不健康！

source: It's play time! Put the things in the right box - Light or Heavy!
zh_hans: 游戏时间！把物品放入正确的框中——轻或重！

source: Italy
zh_hans: 意大利

source: JANUARY
zh_hans: 一月

source: Japan
zh_hans: 日本

source: jog
zh_hans: 慢跑

source: Join the letter blocks to create a fun word!
zh_hans: 连接字母方块，组成一个有趣的单词！

source: Join the word blocks to create a fun sentence!
zh_hans: 将单词块组合成一个有趣的句子！

source: juice
zh_hans: 果汁

source: Juice
zh_hans: 果汁

source: JULY
zh_hans: 七月

source: Jump
zh_hans: 跳

source: jumping
zh_hans: 跳

source: jumps
zh_hans: 跳

source: JUNE
zh_hans: 六月

source: Junk
zh_hans: 垃圾食品

source: Jupiter
zh_hans: 木星

source: JUPITER
zh_hans: 木星

source: Jupiter has a giant storm called the Great Red Spot
zh_hans: 木星上有一个巨大的风暴，叫做大红斑

source: Jupiter has very strong gravity
zh_hans: 木星拥有非常强大的引力

source: Jupiter is a gas giant planet
zh_hans: 木星是一颗气态巨行星

source: Jupiter is about 778 million kilometers from the Sun
zh_hans: 木星距离太阳约7.78亿公里

source: Jupiter is brown and orange
zh_hans: 木星是棕色和橙色的

source: Jupiter is the largest planet in the solar system
zh_hans: 木星是太阳系中最大的行星

source: JupiterN
zh_hans: 木星

source: Kangaroo
zh_hans: 袋鼠

source: kar
zh_hans: 汽车

source: kat
zh_hans: 猫

source: Keep
zh_hans: 保持

source: Keep going until you find all the pairs!
zh_hans: 继续寻找，直到找到所有配对！

source: Keep your plate clean
zh_hans: 保持餐盘干净

source: Keep your Plate clean.
zh_hans: 保持你的盘子清洁。

source: Kestrel
zh_hans: 红隼

source: Keyboard
zh_hans: 键盘

source: Kick
zh_hans: 踢

source: Kick it
zh_hans: 踢它

source: Kind
zh_hans: 善良

source: king
zh_hans: 国王

source: Kingfisher
zh_hans: 翠鸟

source: kitchen
zh_hans: 厨房

source: kite
zh_hans: 风筝

source: Knee
zh_hans: 膝盖

source: KNIFE
zh_hans: 刀

source: KSchool
zh_hans: 学校课堂

source: lake
zh_hans: 湖

source: land
zh_hans: 陆地

source: Laptop
zh_hans: 笔记本电脑

source: Large
zh_hans: 巨大

source: Lark
zh_hans: 云雀

source: Late
zh_hans: 晚

source: Laugh
zh_hans: 笑

source: Lazy
zh_hans: 懒惰的

source: Leaf
zh_hans: 叶子

source: Learn Animal Group Name
zh_hans: 学习动物群体名称

source: Learn Animals Fact
zh_hans: 学习动物知识

source: Learn Baby Animal Names
zh_hans: 学习动物宝宝名称

source: Learn Color Mixing
zh_hans: 学习颜色混合

source: Learn Colors
zh_hans: 学习颜色

source: Learn Colors Level
zh_hans: 学习颜色级别

source: Learn Planets Color
zh_hans: 学习行星颜色

source: Learn Planets Fact
zh_hans: 学习行星知识

source: Learn Planets Fact Level
zh_hans: 学习行星知识关卡

source: Learn Planets Name
zh_hans: 学习行星名称

source: Learn Preposition
zh_hans: 学习介词

source: Learn Punctuation
zh_hans: 学习标点符号

source: Learn Punctuation Level
zh_hans: 学习标点符号级别

source: Learning
zh_hans: 学习

source: Leg
zh_hans: 腿

source: Legs
zh_hans: 腿

source: Leopard
zh_hans: 豹

source: Less
zh_hans: 少

source: Let's go over _ _ _.
zh_hans: 让我们去 _ _ _ 那边。

source: Let's learn good eating habits!
zh_hans: 让我们学习良好的饮食习惯！

source: Letter
zh_hans: 字母

source: Letter Word
zh_hans: 字母单词

source: Level
zh_hans: 级别

source: Level 1
zh_hans: 第1级

source: Level 2
zh_hans: 第2级

source: Level 3
zh_hans: 第3级

source: Level 4
zh_hans: 第4级

source: Level 5
zh_hans: 第5级

source: Level 6
zh_hans: 第6级

source: Level 7
zh_hans: 第7级

source: Level 8
zh_hans: 第8级

source: Level 9
zh_hans: 第9级

source: Level 10
zh_hans: 第10级

source: LID
zh_hans: 锅盖

source: Lift
zh_hans: 举起

source: Light
zh_hans: 光

source: light, night, _ _ _
zh_hans: 光，夜晚，_ _ _

source: Lighter
zh_hans: 较轻

source: Lighter and Heavier
zh_hans: 较轻和较重

source: lights
zh_hans: 灯

source: Lion
zh_hans: 狮子

source: LION
zh_hans: 狮子

source: Listen
zh_hans: 听

source: Listen and choose the planet!
zh_hans: 听一听并选择正确的行星！

source: Listen And Identify Letter
zh_hans: 听音识别字母

source: Listen And Identify Number
zh_hans: 听音识别数字

source: Listen and Learn
zh_hans: 听一听并学习

source: Listen and Watch
zh_hans: 听与看

source: Listen Animal Sound
zh_hans: 听动物声音

source: Listen Health Food Habits
zh_hans: 听一听健康饮食习惯

source: Listen Healthy Food Habits
zh_hans: 聆听健康饮食习惯

source: Listen to sound and Identify letter
zh_hans: 听声音并识别字母

source: Listen to Sound and identify Number
zh_hans: 听声音并识别数字

source: Listen Vehicle Name
zh_hans: 听交通工具名称

source: Listen Vehicle Name Level
zh_hans: 听交通工具名称等级

source: little
zh_hans: 小小的

source: Look
zh_hans: 看

source: Look at ___ stars
zh_hans: 看看___星星

source: Look at ___ sun
zh_hans: 看看___太阳

source: Loud
zh_hans: 响亮的

source: loudly
zh_hans: 大声地

source: lunch
zh_hans: 午餐

source: Lunch
zh_hans: 午餐

source: Lyrebird
zh_hans: 琴鸟

source: M – Multiplication (×)
zh_hans: M – 乘法 (×)

source: Macaw
zh_hans: 金刚鹦鹉

source: Mad
zh_hans: 愤怒

source: Magpie
zh_hans: 喜鹊

source: Malaysia
zh_hans: 马来西亚

source: mall
zh_hans: 购物中心

source: Mango
zh_hans: 芒果

source: Many
zh_hans: 很多

source: MARCH
zh_hans: 三月

source: Marine Iguana
zh_hans: 海鬣蜥

source: Mars
zh_hans: 火星

source: MARS
zh_hans: 火星

source: Mars has strong dust storms
zh_hans: 火星上有强烈的沙尘暴

source: Mars has the tallest volcano in the solar system
zh_hans: 火星拥有太阳系中最高的火山

source: Mars has two small moons
zh_hans: 火星有两颗小卫星

source: Mars is about 225 million kilometers from the Sun
zh_hans: 火星距离太阳约2.25亿公里

source: Mars is called the Red Planet
zh_hans: 火星被称为红色星球

source: Mars is red
zh_hans: 火星是红色的

source: MarsN
zh_hans: 火星

source: Match
zh_hans: 配对

source: Match Animal Movement
zh_hans: 匹配动物的动作

source: Match Animal Movements
zh_hans: 匹配动物移动方式

source: Match Antonyms
zh_hans: 匹配反义词

source: Match Antonyms Level
zh_hans: 反义词配对关卡

source: Match Shape
zh_hans: 形状配对

source: Match Shape Level
zh_hans: 形状配对关卡

source: Match Synonyms
zh_hans: 匹配同义词

source: Match the Animals with their Movements
zh_hans: 将动物与它们的移动方式进行匹配

source: Match the Antonyms
zh_hans: 匹配反义词

source: Match the Image with Letter
zh_hans: 图片与字母配对

source: Match The Image With Letter
zh_hans: 图片与字母配对

source: Match the planets in the correct order from the Sun (Based on increasing distance from the Sun).
zh_hans: 请按照距离太阳由近到远的顺序排列行星。

source: Match the Word
zh_hans: 匹配单词

source: Match Word
zh_hans: 单词配对

source: Match Word Level
zh_hans: 单词配对关卡

source: Match Words
zh_hans: 单词配对

source: Math Operations
zh_hans: 数学运算

source: Maths
zh_hans: 数学

source: MAY
zh_hans: 五月

source: Maybe
zh_hans: 也许

source: Maze
zh_hans: 迷宫

source: Maze Level
zh_hans: 迷宫关卡

source: MCB
zh_hans: 小型断路器

source: Meals
zh_hans: 餐食

source: Measurement
zh_hans: 测量

source: Measuring Tape
zh_hans: 卷尺

source: Medium
zh_hans: 中等

source: meow
zh_hans: 喵喵

source: Meow
zh_hans: 喵喵叫

source: Mercury
zh_hans: 水星

source: MERCURY
zh_hans: 水星

source: Mercury has extreme temperatures
zh_hans: 水星的温度变化极端

source: Mercury has no moons
zh_hans: 水星没有卫星

source: Mercury has the shortest year in the solar system
zh_hans: 水星拥有太阳系中最短的一年

source: Mercury is grey
zh_hans: 水星是灰色的

source: Mercury is the closest planet to the Sun
zh_hans: 水星是离太阳最近的行星

source: Mercury is the smallest planet in the solar system
zh_hans: 水星是太阳系中最小的行星

source: MercuryN
zh_hans: 水星

source: Metal
zh_hans: 金属

source: Mexico
zh_hans: 墨西哥

source: Microphone
zh_hans: 麦克风

source: Mild
zh_hans: 温和

source: milk
zh_hans: 牛奶

source: Milk
zh_hans: 牛奶

source: Minus
zh_hans: 减法

source: Minus and Fill
zh_hans: 减法填空

source: Mira
zh_hans: 米拉

source: Mira drinks milk
zh_hans: 米拉喝牛奶

source: Mira is drinking milk
zh_hans: 米拉正在喝牛奶

source: Mohan
zh_hans: 莫汉

source: Mohan is jumping high
zh_hans: 莫汉跳得很高

source: Mohan jumps high
zh_hans: 莫汉跳得很高

source: Mom
zh_hans: 妈妈

source: Mom gave it _ _ _ Dad.
zh_hans: 妈妈把它给了 _ _ _ 爸爸。

source: MONDAY
zh_hans: 星期一

source: Monitor
zh_hans: 显示器

source: monkey
zh_hans: 猴子

source: Monkey
zh_hans: 猴子

source: MONKEY
zh_hans: 猴子

source: moo
zh_hans: 哞哞

source: Moon
zh_hans: 月亮

source: moon, spoon, _ _ _
zh_hans: 月亮，勺子，_ _ _

source: Moose
zh_hans: 驼鹿

source: Mouse
zh_hans: 老鼠

source: mouse, house, _ _ _
zh_hans: 老鼠，房子，_ _ _

source: Mouth
zh_hans: 嘴巴

source: Move
zh_hans: 移动

source: Move the clock hands to show the right time.
zh_hans: 移动时钟指针以显示正确的时间。

source: mug
zh_hans: 杯子

source: Music
zh_hans: 音乐

source: My bird
zh_hans: 我的鸟

source: My cat
zh_hans: 我的猫

source: My dog
zh_hans: 我的狗

source: Myna
zh_hans: 八哥

source: name
zh_hans: 名字

source: Name the Picture
zh_hans: 说出图片名称

source: Name The Picture
zh_hans: 说出图片名称

source: Name The Picture Level
zh_hans: 说出图片名称等级

source: Napkin
zh_hans: 餐巾

source: Nature
zh_hans: 自然

source: Near
zh_hans: 近

source: Nepal
zh_hans: 尼泊尔

source: Neptune
zh_hans: 海王星

source: NEPTUNE
zh_hans: 海王星

source: Neptune appears dark blue in color
zh_hans: 海王星呈深蓝色

source: Neptune has very fast winds
zh_hans: 海王星拥有非常强劲的风

source: Neptune is dark blue
zh_hans: 海王星是深蓝色的

source: Neptune is the coldest planet in the solar system
zh_hans: 海王星是太阳系中最寒冷的行星

source: Neptune is the farthest planet from the Sun
zh_hans: 海王星是离太阳最远的行星

source: Neptune is the windiest planet in the solar system
zh_hans: 海王星是太阳系中风力最强的行星

source: Neptune was the last planet discovered
zh_hans: 海王星是最后被发现的行星

source: NeptuneN
zh_hans: 海王星

source: nest
zh_hans: 鸟巢

source: Netherlands
zh_hans: 荷兰

source: Never
zh_hans: 从不

source: Never skip your breakfast
zh_hans: 不要错过早餐

source: Never skip your Breakfast.
zh_hans: 不要错过早餐。

source: Next
zh_hans: 下一步

source: NEXT
zh_hans: 下一步

source: Nice
zh_hans: 友善

source: night
zh_hans: 夜晚

source: Night
zh_hans: 夜晚

source: Nightingale
zh_hans: 夜莺

source: Nine
zh_hans: 九

source: Nineteen
zh_hans: 十九

source: No
zh_hans: 没有

source: No rings
zh_hans: 没有光环

source: None
zh_hans: 没有

source: Normally
zh_hans: 正常地

source: North America
zh_hans: 北美洲

source: North Korea
zh_hans: 朝鲜

source: Nose
zh_hans: 鼻子

source: nose, rose, _ _ _
zh_hans: 鼻子，玫瑰，_ _ _

source: NOVEMBER
zh_hans: 十一月

source: Number
zh_hans: 数字

source: Number Names
zh_hans: 数字名称

source: NURSE
zh_hans: 护士

source: Nut
zh_hans: 螺母

source: O – Orders (powers like ², ³, √)
zh_hans: O – 次方（如 ²、³、√）

source: OCTOBER
zh_hans: 十月

source: Octopus
zh_hans: 章鱼

source: off
zh_hans: 关闭

source: office
zh_hans: 办公室

source: Old
zh_hans: 年老

source: Omnivores Animals
zh_hans: 杂食动物

source: on
zh_hans: 在...上

source: On
zh_hans: 在……上面

source: On a car
zh_hans: 在汽车上

source: On a tree
zh_hans: 在树上

source: On the bed
zh_hans: 在床上

source: on the floor
zh_hans: 在地板上

source: On the mat
zh_hans: 在垫子上

source: on the paper
zh_hans: 在纸上

source: On the tree
zh_hans: 在树上

source: Once a day
zh_hans: 每天一次

source: Once a month
zh_hans: 每月一次

source: Once a week
zh_hans: 每周一次

source: Once a year
zh_hans: 每年一次

source: One
zh_hans: 一颗

source: Ones
zh_hans: 个位

source: ONION
zh_hans: 洋葱

source: Only at night
zh_hans: 只在夜晚

source: Open
zh_hans: 打开

source: Orange
zh_hans: 橙子

source: ORANGE
zh_hans: 橙色

source: Order Sentence
zh_hans: 句子排序

source: Order Sentence Level
zh_hans: 句子排序关卡

source: Order Shape
zh_hans: 形状排序

source: Order Shape by Size
zh_hans: 按大小排序形状

source: Order Shape Level
zh_hans: 形状排序关卡

source: Order to solve sums:
zh_hans: 计算顺序：

source: Oriole
zh_hans: 黄鹂

source: Osprey
zh_hans: 鱼鹰

source: Ostrich
zh_hans: 鸵鸟

source: Out of
zh_hans: 从……出来

source: Outside
zh_hans: 外面

source: Over
zh_hans: 在……上面

source: over the rope
zh_hans: 越过绳子

source: Owl
zh_hans: 猫头鹰

source: Painted Turtle
zh_hans: 彩龟

source: pair
zh_hans: 一对

source: Pakistan
zh_hans: 巴基斯坦

source: PAN
zh_hans: 平底锅

source: Panda
zh_hans: 熊猫

source: PANDA
zh_hans: 熊猫

source: Panther
zh_hans: 黑豹

source: Parentheses
zh_hans: 括号

source: Parrot
zh_hans: 鹦鹉

source: Parts of Computer
zh_hans: 电脑部件

source: Parts Of Computer
zh_hans: 电脑部件

source: Parts of Dog
zh_hans: 狗的身体部位

source: Parts of Fish
zh_hans: 鱼的身体部位

source: Parts of Plant
zh_hans: 植物部位

source: Parts Of Plant
zh_hans: 植物部位

source: Parts of Tree
zh_hans: 树的部位

source: Paste
zh_hans: 粘贴

source: Paw
zh_hans: 爪子

source: Peacock
zh_hans: 孔雀

source: PEAS
zh_hans: 豌豆

source: Pelican
zh_hans: 鹈鹕

source: pen
zh_hans: 钢笔

source: pen, hen, _ _ _
zh_hans: 钢笔，母鸡，_ _ _

source: pencil
zh_hans: 铅笔

source: Penguin
zh_hans: 企鹅

source: Period / Full Stop
zh_hans: 句号

source: Pets
zh_hans: 宠物

source: Phonics
zh_hans: 自然拼读

source: Pick
zh_hans: 拿起

source: Pick Correct Spelling
zh_hans: 选择正确的拼写

source: Pick Correct Spelling Level
zh_hans: 选择正确拼写等级

source: Pick the correct option
zh_hans: 选择正确的选项

source: Pick The Correct Option
zh_hans: 选择正确的选项

source: Pick The Correct Option Level
zh_hans: 选择正确选项等级

source: Pick the correct spelling
zh_hans: 选择正确的拼写

source: Pick The Correct Spelling
zh_hans: 选择正确拼写

source: Pick The Correct Spelling Level
zh_hans: 选择正确拼写等级

source: Picture
zh_hans: 图片

source: Pig
zh_hans: 猪

source: Pigeon
zh_hans: 鸽子

source: pill
zh_hans: 药丸

source: PILOT
zh_hans: 飞行员

source: PINK
zh_hans: 粉色

source: PLANE
zh_hans: 飞机

source: Planet Order Match
zh_hans: 行星顺序配对

source: Planets Fact
zh_hans: 行星知识

source: Planets Fact Level
zh_hans: 行星知识关卡

source: Plate
zh_hans: 盘子

source: PLATE
zh_hans: 盘子

source: Play
zh_hans: 玩

source: Play and exercise every day
zh_hans: 每天玩耍和锻炼

source: Play and Exercise every day.
zh_hans: 每天玩耍和锻炼。

source: Play with it
zh_hans: 和它一起玩

source: play, stay, _ _ _
zh_hans: 玩，停留，_ _ _

source: playing
zh_hans: 玩

source: plays
zh_hans: 玩耍

source: Plier
zh_hans: 钳子

source: Plug
zh_hans: 插头

source: Plural Form
zh_hans: 复数形式

source: Plural Form Level
zh_hans: 复数形式关卡

source: Plus
zh_hans: 加法

source: Polar Bear
zh_hans: 北极熊

source: POLICE
zh_hans: 警察

source: pond
zh_hans: 池塘

source: POT
zh_hans: 锅

source: POTATO
zh_hans: 土豆

source: pox
zh_hans: 痘疮

source: Precipitation
zh_hans: 降水

source: Pretty
zh_hans: 漂亮

source: Primary Consumer
zh_hans: 初级消费者

source: Printer
zh_hans: 打印机

source: Producer
zh_hans: 生产者

source: Projector
zh_hans: 投影仪

source: Proper Noun
zh_hans: 专有名词

source: Ptarmigan
zh_hans: 雷鸟

source: Pull
zh_hans: 拉

source: PUMPKIN
zh_hans: 南瓜

source: pup
zh_hans: 小狗

source: Purple
zh_hans: 紫色

source: PURPLE
zh_hans: 紫色

source: Push
zh_hans: 推

source: Put
zh_hans: 穿上

source: Put the animals in the right box - Home or Jungle!
zh_hans: 把动物放到正确的框里——家养或丛林！

source: Put your bag over _ _ _.
zh_hans: 把你的包放在 _ _ _ 那边。

source: Puzzle
zh_hans: 拼图

source: Quack
zh_hans: 嘎嘎叫

source: Quail
zh_hans: 鹌鹑

source: question
zh_hans: 疑问句

source: Question
zh_hans: 第

source: Question Mark
zh_hans: 问号

source: Quick
zh_hans: 迅速

source: quiet
zh_hans: 安静

source: Quiz
zh_hans: 测验

source: Quotation Marks
zh_hans: 引号

source: rabbit
zh_hans: 兔子

source: Rabbit
zh_hans: 兔子

source: Raccoon Dog
zh_hans: 狸

source: Rain
zh_hans: 雨

source: Rain storms
zh_hans: 暴雨风暴

source: Rainbow
zh_hans: 彩虹

source: rains
zh_hans: 下雨

source: Raja
zh_hans: 拉贾

source: Raja is eating
zh_hans: 拉贾正在吃东西

source: Raja is eating rice
zh_hans: 拉贾正在吃米饭

source: Raju
zh_hans: 拉朱

source: Raju is singing a song
zh_hans: 拉朱正在唱歌

source: Raju sings song
zh_hans: 拉朱唱歌

source: rake
zh_hans: 耙子

source: Rani
zh_hans: 拉妮

source: Rani is playing ball
zh_hans: 拉妮正在玩球

source: Rani plays in Delhi
zh_hans: 拉妮在德里玩耍

source: rat
zh_hans: 猫

source: Ravi
zh_hans: 拉维

source: Ravi is running fast
zh_hans: 拉维正在快速奔跑

source: Ravi runs fast
zh_hans: 拉维跑得很快

source: Read
zh_hans: 阅读

source: reading
zh_hans: 阅读

source: Reading
zh_hans: 阅读

source: Reading Corner
zh_hans: 阅读角

source: reads
zh_hans: 阅读

source: Rear-view Mirror
zh_hans: 后视镜

source: Rearrange the numbers in ascending order
zh_hans: 按升序重新排列数字

source: Rearrange the numbers in descending order
zh_hans: 按降序重新排列数字

source: Red
zh_hans: 红色

source: RED
zh_hans: 红色

source: Red and blue
zh_hans: 红色和蓝色

source: Remember Shape And Color
zh_hans: 记住形状和颜色

source: Remember the colors of the shapes, press 'Go', and pick the right color for each shape!
zh_hans: 记住每个形状的颜色，点击“开始”，然后为每个形状选择正确的颜色！

source: Repeat
zh_hans: 重复

source: Repeat Pattern
zh_hans: 重复图案

source: Reset
zh_hans: 重置

source: Rhinoceros
zh_hans: 犀牛

source: Rhyming Word Level
zh_hans: 押韵单词关卡

source: Rhyming Words
zh_hans: 押韵词

source: rice
zh_hans: 米饭

source: ring, sing, _ _ _
zh_hans: 戒指，唱歌，_ _ _

source: Rings
zh_hans: 光环

source: road
zh_hans: 道路

source: Road Signs And Signals
zh_hans: 道路标志与信号

source: Roar
zh_hans: 咆哮

source: Robin
zh_hans: 知更鸟

source: Rocky
zh_hans: 岩石类

source: Roll
zh_hans: 滚动

source: Roman Numerals
zh_hans: 罗马数字

source: Rooster
zh_hans: 公鸡

source: Root
zh_hans: 根

source: Root Hairs
zh_hans: 根毛

source: Roots
zh_hans: 根

source: Round
zh_hans: 圆的

source: Rugby Ball
zh_hans: 橄榄球

source: run
zh_hans: 跑

source: Run
zh_hans: 跑

source: Run away
zh_hans: 跑开

source: running
zh_hans: 跑

source: runs
zh_hans: 跑

source: Russia
zh_hans: 俄罗斯

source: S – Subtraction (-)
zh_hans: S – 减法 (-)

source: Sad
zh_hans: 伤心

source: sadly
zh_hans: 伤心地

source: Salty
zh_hans: 咸的

source: sand
zh_hans: 沙子

source: Santa Claus
zh_hans: 圣诞老人

source: SATURDAY
zh_hans: 星期六

source: Saturn
zh_hans: 土星

source: SATURN
zh_hans: 土星

source: Saturn has beautiful rings
zh_hans: 土星拥有美丽的光环

source: Saturn has many rings
zh_hans: 土星有许多光环

source: Saturn has the most moons in the solar system
zh_hans: 土星拥有太阳系中最多的卫星

source: Saturn is about 1.4 billion kilometers from the Sun
zh_hans: 土星距离太阳约14亿公里

source: Saturn is less dense than water
zh_hans: 土星的密度比水还小

source: Saturn is very light for its size
zh_hans: 土星相对于它的大小来说非常轻

source: Saturn is yellow and has rings
zh_hans: 土星是黄色的并且有光环

source: SaturnN
zh_hans: 土星

source: Saudi Arabia
zh_hans: 沙特阿拉伯

source: Saw
zh_hans: 锯子

source: Say no to cold drinks
zh_hans: 拒绝冷饮

source: Say no to Cold drinks.
zh_hans: 拒绝冷饮。

source: Scanner
zh_hans: 扫描仪

source: Scary
zh_hans: 可怕的

source: School items
zh_hans: 学校用品

source: Science
zh_hans: 科学

source: SCIENTIST
zh_hans: 科学家

source: Score
zh_hans: 得分

source: Score:
zh_hans: 得分：

source: Screwdriver
zh_hans: 螺丝刀

source: Seagull
zh_hans: 海鸥

source: Seasons
zh_hans: 季节

source: Seat Belt
zh_hans: 安全带

source: Secondary Consumer
zh_hans: 次级消费者

source: see
zh_hans: 看见

source: Select the action word from the sentence
zh_hans: 从句子中选择动作词

source: Select the Biggest Number
zh_hans: 选择最大的数字

source: Select the correct article
zh_hans: 选择正确的冠词

source: Select the correct helping verb
zh_hans: 选择正确的系动词

source: Select the correct option
zh_hans: 选择正确的选项

source: Select the Correct Option
zh_hans: 选择正确的选项
